In [1]:
import numpy as np
import pandas as pd

In [2]:
"""
None: Pythonic missing data
"""

arr1 = np.array([1, None, 3, 4])
print(arr1.dtype)

arr2 = np.array([1, 2, 3, 4])
print(arr2.dtype)

# None objects as missing values

object
int32

In [3]:
arr3 = np.array([1, np.nan, 3, 4])
print(arr3.dtype)

float64

In [13]:
arr3.sum()

nan

In [17]:
np.nanmin(arr3)

1.0

In [4]:
pd.Series([1, np.nan, 2, None])

0    1.0
1    NaN
2    2.0
3    NaN
dtype: float64

In [22]:
#isnull

ser = pd.Series([1, np.nan, 'hello', None])
print(ser)

0        1
1      NaN
2    hello
3     None
dtype: object

In [24]:
ser.isnull()

0    False
1     True
2    False
3     True
dtype: bool

In [26]:
#notnull()

ser.notnull()

0     True
1    False
2     True
3    False
dtype: bool

In [28]:
#dropna()

ser.dropna()

0        1
2    hello
dtype: object

In [8]:
print(1+np.nan)
print(0*np.nan)
print(arr3.sum())

nan
nan
nan

In [29]:
ser = pd.Series([1, np.nan, 2, None, 3],
             index=list('abcde'))
ser

a    1.0
b    NaN
c    2.0
d    NaN
e    3.0
dtype: float64

In [30]:
ser.fillna(0)

a    1.0
b    0.0
c    2.0
d    0.0
e    3.0
dtype: float64

In [31]:
ser.fillna(method='ffill')

a    1.0
b    1.0
c    2.0
d    2.0
e    3.0
dtype: float64

In [32]:
ser.fillna(method='bfill')

a    1.0
b    2.0
c    2.0
d    3.0
e    3.0
dtype: float64

In [33]:
df = pd.DataFrame([[1, np.nan, 2],
                  [2, 3, 5],
                  [np.nan, 4, 6]])
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [34]:
df.dropna()

     0    1  2
1  2.0  3.0  5

In [35]:
df.dropna(axis='columns')

   2
0  2
1  5
2  6

In [36]:
df[3]=np.nan
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [37]:
df.dropna(axis='rows', thresh=3)

     0    1  2   3
1  2.0  3.0  5 NaN

In [38]:
df.fillna(method='bfill', axis='rows')

     0    1  2   3
0  1.0  3.0  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN